FemDesign.Reinforcement.Center
center (child of shell_rf_params_type)

FemDesign.Reinforcement.Center.#ctor
Parameterless constructor for serialization.

FemDesign.Reinforcement.Center.#ctor(System.Double,System.Double,System.Double,System.Boolean)
Private constructor accessed by static methods.

FemDesign.Reinforcement.Center.Straight
Create a Center element representing a Straight lay-out.
Returns: